nxp-appcodehub/an-bidirectional-dcdc-mc56f83783/Bidir_DCDC_MC56F83783/board/pin_mux.c
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MC56F83783
package_id: MC56F83783VLH
mcu_data: ksdk2_0
processor_version: 15.0.0
pin_labels:
- {pin_num: '46', pin_signal: GPIOE1/PWMA_0A/XB_OUT5, label: PWMA0A}
- {pin_num: '45', pin_signal: GPIOE0/PWMA_0B/XB_OUT4, label: PWMA0B}
- {pin_num: '48', pin_signal: GPIOE3/PWMA_1A/XB_OUT7, label: PWMA1A}
- {pin_num: '47', pin_signal: GPIOE2/PWMA_1B/XB_OUT6, label: PWMA1B}
- {pin_num: '15', pin_signal: GPIOA2/ANA2/VREFHA/CMPA_IN1, label: Vbat}
- {pin_num: '16', pin_signal: GPIOA3/ANA3/VREFLA/CMPA_IN2, label: Vbus}
- {pin_num: '9', pin_signal: GPIOA7/ANA7, label: Vhv}
- {pin_num: '24', pin_signal: GPIOB0/ANB0/CMPB_IN3, label: Ibat}
- {pin_num: '25', pin_signal: GPIOB1/ANB1/CMPB_IN0/DACB_O, label: Ibuck}
- {pin_num: '17', pin_signal: GPIOB7/ANB7/CMPB_IN2, label: Iboost}
- {pin_num: '14', pin_signal: GPIOA1/ANA1/CMPA_IN0, label: Ir_lv(+)}
- {pin_num: '13', pin_signal: GPIOA0/ANA0/CMPA_IN3/CMPC_O, label: Vds_SR1}
- {pin_num: '19', pin_signal: GPIOB6/ANB6/CMPB_IN1, label: Ihv}
- {pin_num: '21', pin_signal: GPIOB4/ANB4/CMPC_IN1, label: Ir_lv(-)}
- {pin_num: '20', pin_signal: GPIOB5/ANB5/CMPC_IN2, label: Vr_hv(-)}
- {pin_num: '27', pin_signal: GPIOB2/ANB2/VREFHB/CMPC_IN3, label: Vds_SR2}
- {pin_num: '12', pin_signal: GPIOA4/ANA4/CMPD_IN0, label: Vr_hv(+)}
- {pin_num: '59', pin_signal: GPIOF7/TB3/CMPC_O/XB_IN3, label: Load_SW, identifier: Load_SW}
- {pin_num: '56', pin_signal: GPIOC15/SCL0/XB_OUT5/PWMA_FAULT5, label: STB_EN, identifier: STB_EN}
- {pin_num: '3', pin_signal: GPIOC0/EXTAL/CLKIN0, label: User_LED, identifier: User_LED}
- {pin_num: '33', pin_signal: GPIOC8/MISO0/RXD0/XB_IN9, label: User_LED1, identifier: User_LED1}
- {pin_num: '49', pin_signal: GPIOC13/TA3/XB_IN6/EWM_OUT_B, label: XBAR_TP1, identifier: XBAR_TP1}
- {pin_num: '18', pin_signal: GPIOC5/DACA_O/XB_IN7, label: XBAR_TP2, identifier: XBAR_TP2}
- {pin_num: '36', pin_signal: GPIOF0/XB_IN6/TB2, label: XBAR_TP3, identifier: XBAR_TP3}
- {pin_num: '32', pin_signal: GPIOC7/SS0_B/TXD0/XB_IN8/XB_OUT6, label: XBAR_TP4, identifier: XBAR_TP4}
- {pin_num: '52', pin_signal: GPIOE5/PWMA_2A/XB_IN3/XB_OUT9, label: PWMA2A}
- {pin_num: '53', pin_signal: GPIOE6/PWMA_3B/XB_IN4/PWMB_2B/XB_OUT10, label: PWMA3B}
- {pin_num: '51', pin_signal: GPIOE4/PWMA_2B/XB_IN2/XB_OUT8, label: PWMA2B}
- {pin_num: '54', pin_signal: GPIOE7/PWMA_3A/XB_IN5/PWMB_2A/XB_OUT11, label: PWMA3A}
- {pin_num: '34', pin_signal: GPIOC9/SCLK0/XB_IN4/TXD0/XB_OUT8, label: XBAR_TP5, identifier: XBAR_TP5}
- {pin_num: '4', pin_signal: GPIOC1/XTAL, label: LED_HVP, identifier: LED_HVP}
- {pin_num: '58', pin_signal: GPIOF6/TB2/PWMA_3X/PWMB_3X/XB_IN2, label: TEMP_HV}
- {pin_num: '8', pin_signal: GPIOC4/TA1/CMPB_O/XB_IN8/EWM_OUT_B, label: TEMP_LV}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_sim.h"
#include "fsl_gpio.h"
#include "fsl_xbara.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    Common_Config_Pin();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BCM_Config_Pin:
- options: {createDeInit: 'true', callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '53', peripheral: EVTG, signal: 'EVTG1_OUT, B', pin_signal: GPIOE6/PWMA_3B/XB_IN4/PWMB_2B/XB_OUT10}
  - {pin_num: '52', peripheral: EVTG, signal: 'EVTG1_OUT, A', pin_signal: GPIOE5/PWMA_2A/XB_IN3/XB_OUT9}
  - {peripheral: EVTG, signal: 'EVTG2, B', pin_signal: CMPC_OUT}
  - {peripheral: EVTG, signal: 'EVTG2, A', pin_signal: PWMA3_MUX_TRIG0}
  - {peripheral: EVTG, signal: 'EVTG1, B', pin_signal: CMPA_OUT}
  - {peripheral: EVTG, signal: 'EVTG1, A', pin_signal: PWMA2_MUX_TRIG0}
  - {peripheral: CMPC, signal: WIN_SMP, pin_signal: EVTG0_OUTB}
  - {peripheral: CMPA, signal: WIN_SMP, pin_signal: EVTG0_OUTA}
  - {peripheral: EVTG, signal: 'EVTG0, D', pin_signal: TA3_OUT}
  - {peripheral: EVTG, signal: 'EVTG0, C', pin_signal: TA2_OUT}
  - {peripheral: EVTG, signal: 'EVTG0, B', pin_signal: TA1_OUT}
  - {peripheral: EVTG, signal: 'EVTG0, A', pin_signal: TA0_OUT}
  - {peripheral: PWMA, signal: 'FAULT, 0', pin_signal: CMPB_OUT}
  - {peripheral: TMRA, signal: 'IN, 1', pin_signal: CMPC_OUT}
  - {peripheral: TMRA, signal: 'IN, 0', pin_signal: CMPA_OUT}
  - {pin_num: '46', peripheral: PWMA, signal: 'A, 0', pin_signal: GPIOE1/PWMA_0A/XB_OUT5}
  - {pin_num: '45', peripheral: PWMA, signal: 'B, 0', pin_signal: GPIOE0/PWMA_0B/XB_OUT4}
  - {pin_num: '48', peripheral: PWMA, signal: 'A, 1', pin_signal: GPIOE3/PWMA_1A/XB_OUT7}
  - {pin_num: '47', peripheral: PWMA, signal: 'B, 1', pin_signal: GPIOE2/PWMA_1B/XB_OUT6}
  - {pin_num: '51', peripheral: EVTG, signal: 'EVTG2_OUT, A', pin_signal: GPIOE4/PWMA_2B/XB_IN2/XB_OUT8}
  - {pin_num: '54', peripheral: EVTG, signal: 'EVTG2_OUT, B', pin_signal: GPIOE7/PWMA_3A/XB_IN5/PWMB_2A/XB_OUT11}
  - {pin_num: '59', peripheral: GPIOF, signal: 'GPIO, 7', pin_signal: GPIOF7/TB3/CMPC_O/XB_IN3, direction: OUTPUT}
  - {pin_num: '56', peripheral: GPIOC, signal: 'GPIO, 15', pin_signal: GPIOC15/SCL0/XB_OUT5/PWMA_FAULT5, direction: OUTPUT}
  - {pin_num: '3', peripheral: GPIOC, signal: 'GPIO, 0', pin_signal: GPIOC0/EXTAL/CLKIN0, direction: OUTPUT}
  - {pin_num: '33', peripheral: GPIOC, signal: 'GPIO, 8', pin_signal: GPIOC8/MISO0/RXD0/XB_IN9, direction: OUTPUT}
  - {pin_num: '49', peripheral: GPIOC, signal: 'GPIO, 13', pin_signal: GPIOC13/TA3/XB_IN6/EWM_OUT_B, direction: OUTPUT}
  - {pin_num: '18', peripheral: GPIOC, signal: 'GPIO, 5', pin_signal: GPIOC5/DACA_O/XB_IN7, direction: OUTPUT}
  - {pin_num: '36', peripheral: GPIOF, signal: 'GPIO, 0', pin_signal: GPIOF0/XB_IN6/TB2, direction: OUTPUT}
  - {pin_num: '4', peripheral: GPIOC, signal: 'GPIO, 1', pin_signal: GPIOC1/XTAL, direction: OUTPUT}
  - {peripheral: ADC, signal: 'SYNC, A', pin_signal: PWMA0_MUX_TRIG0}
  - {pin_num: '32', peripheral: EVTG, signal: 'EVTG0_OUT, A', pin_signal: GPIOC7/SS0_B/TXD0/XB_IN8/XB_OUT6}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

