nxp-appcodehub/an-bidirectional-dcdc-mc56f83783/Bidir_DCDC_MC56F83783/board/pin_mux.c
    /* ADC and TMR Select */
    /* xbar input 36.: xbar input 36, TMRA0. */
    SIM_SetXbarInputAdcTmrSelection(SIM, kSIM_XBARIN36Index, kSIM_XBARIN36TMRA0);
    /* xbar input 37.: xbar input 37, TMRA1. */
    SIM_SetXbarInputAdcTmrSelection(SIM, kSIM_XBARIN37Index, kSIM_XBARIN37TMRA1);
    /* xbar input 38.: xbar input 38, TMRA2. */
    SIM_SetXbarInputAdcTmrSelection(SIM, kSIM_XBARIN38Index, kSIM_XBARIN38TMRA2);
    /* xbar input 39.: xbar input 39, TMRA3. */
    SIM_SetXbarInputAdcTmrSelection(SIM, kSIM_XBARIN39Index, kSIM_XBARIN39TMRA3);

    /* Internal Peripheral Select */
    /* Select PWMA Fault 0 Input.: Select PWMA Fault 0 Input, XB_OUT29. */
    SIM_SetInternalPeriInput(SIM, kSIM_PWMAFault0InputIndex, kSIM_PWMAFault0Input_XB_OUT29);
    /* Select TMRA0 Input.: Select TMRA0 Input, XB_OUT38. */
    SIM_SetInternalPeriInput(SIM, kSIM_TMRA0InputIndex, kSIM_TMRA0Input_XB_OUT38);
    /* Select TMRA1 Input.: Select TMRA1 Input, XB_OUT39. */
    SIM_SetInternalPeriInput(SIM, kSIM_TMRA1InputIndex, kSIM_TMRA1Input_XB_OUT39);

    /* PWM Select */
    /* xbar input 20.: xbar input 20, PWMA0_MUX_TRIG0. */
    SIM_SetXbarInputPWMSelection(SIM, kSIM_XBARIN20Index, kSIM_XbarIn20PWMA0MuxTrig0);
    /* xbar input 24.: xbar input 24, PWMA2_MUX_TRIG0. */
    SIM_SetXbarInputPWMSelection(SIM, kSIM_XBARIN24Index, kSIM_XbarIn24PWMA2MuxTrig0);
    /* xbar input 26.: xbar input 26, PWMA3_MUX_TRIG0. */
    SIM_SetXbarInputPWMSelection(SIM, kSIM_XBARIN26Index, kSIM_XbarIn26PWMA3MuxTrig0);

    /* CMPB_OUT output assigned to XBARA_IN13 input is connected
     * to XBARA_OUT29 output assigned to PWMA_PWMB_FAULT0 */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputCmpbOut, kXBARA_OutputPwmaPwmbFault0);
    /* CMPA_OUT output assigned to XBARA_IN12 input is connected
     * to XBARA_OUT38 output assigned to TA0_IN */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputCmpaOut, kXBARA_OutputTa0In);
    /* CMPC_OUT output assigned to XBARA_IN14 input is connected
     * to XBARA_OUT39 output assigned to TA1_IN */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputCmpcOut, kXBARA_OutputTa1In);
    /* AN0_LIMIT_TA0_OUT output assigned to XBARA_IN36 input is connected
     * to XBARA_OUT47 output assigned to EVTG0_A */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputAn0LimitTa0Out, kXBARA_OutputEvtg0A);
    /* AN1_LIMIT_TA1_OUT output assigned to XBARA_IN37 input is connected
     * to XBARA_OUT48 output assigned to EVTG0_B */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputAn1LimitTa1Out, kXBARA_OutputEvtg0B);
    /* AN2_LIMIT_TA2_OUT output assigned to XBARA_IN38 input is connected
     * to XBARA_OUT49 output assigned to EVTG0_C */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputAn2LimitTa2Out, kXBARA_OutputEvtg0C);
    /* AN3_LIMIT_TA3_OUT output assigned to XBARA_IN39 input is connected
     * to XBARA_OUT50 output assigned to EVTG0_D */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputAn3LimitTa3Out, kXBARA_OutputEvtg0D);
    /* PWMA2_MUX_PWMB2_OUT_TRIG0 output assigned to XBARA_IN24 input is connected
     * to XBARA_OUT51 output assigned to EVTG1_A */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputPwma2MuxPwmb2OutTrig0, kXBARA_OutputEvtg1A);
    /* CMPA_OUT output assigned to XBARA_IN12 input is connected
     * to XBARA_OUT52 output assigned to EVTG1_B */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputCmpaOut, kXBARA_OutputEvtg1B);
    /* PWMA3_MUX_PWMB3_OUT_TRIG0 output assigned to XBARA_IN26 input is connected
     * to XBARA_OUT55 output assigned to EVTG2_A */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputPwma3MuxPwmb3OutTrig0, kXBARA_OutputEvtg2A);
    /* CMPC_OUT output assigned to XBARA_IN14 input is connected
     * to XBARA_OUT56 output assigned to EVTG2_B */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputCmpcOut, kXBARA_OutputEvtg2B);
    /* EVTG0_OUTA output assigned to XBARA_IN40 input is connected
     * to XBARA_OUT6 output assigned to XB_OUT6 */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputEvtg0Outa, kXBARA_OutputXbOut6);
    /* EVTG2_OUTA output assigned to XBARA_IN42 input is connected
     * to XBARA_OUT8 output assigned to XB_OUT8 */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputEvtg2Outa, kXBARA_OutputXbOut8);
    /* EVTG1_OUTA output assigned to XBARA_IN41 input is connected
     * to XBARA_OUT9 output assigned to XB_OUT9 */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputEvtg1Outa, kXBARA_OutputXbOut9);
    /* EVTG1_OUTB output assigned to XBARA_IN47 input is connected
     * to XBARA_OUT10 output assigned to XB_OUT10 */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputEvtg1Outb, kXBARA_OutputXbOut10);
    /* EVTG2_OUTB output assigned to XBARA_IN48 input is connected
     * to XBARA_OUT11 output assigned to XB_OUT11 */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputEvtg2Outb, kXBARA_OutputXbOut11);
    /* PWMA0_MUX_PWMB0_OUT_TRIG0 output assigned to XBARA_IN20 input is connected
     * to XBARA_OUT12 output assigned to ADCA_SYNC */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputPwma0MuxPwmb0OutTrig0, kXBARA_OutputAdcaSync);
    /* EVTG0_OUTA output assigned to XBARA_IN40 input is connected
     * to XBARA_OUT16 output assigned to CMPA */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputEvtg0Outa, kXBARA_OutputCmpa);
    /* EVTG0_OUTB output assigned to XBARA_IN46 input is connected
     * to XBARA_OUT18 output assigned to CMPC */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputEvtg0Outb, kXBARA_OutputCmpc);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BCM_Config_Pin_deinit
 * Description   : This is a de-initialization function for 'BCM_Config_Pin' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 * END ****************************************************************************************************************/
void BCM_Config_Pin_deinit(void)
{
    /* There are conflicts or other incorrect settings in the configuration, the code below is generated only for 
     * those registers which are set correctly and without a conflict. Open this file in Pins Tool for more details. */

    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* GPIOE IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOE);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIO functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin0, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOC1 (pin 4) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin1, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOC5 (pin 18) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin5, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOC7 (pin 32) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin7, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOC8 (pin 33) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin8, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOC13 (pin 49) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin13, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOC15 (pin 56) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin15, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE0 (pin 45) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin0, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE1 (pin 46) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin1, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE2 (pin 47) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin2, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE3 (pin 48) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin3, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE4 (pin 51) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin4, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE5 (pin 52) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin5, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE6 (pin 53) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin6, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE7 (pin 54) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin7, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF0 (pin 36) */
    GPIO_PinSetPeripheralMode(GPIOF, kGPIO_Pin0, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF7 (pin 59) */
    GPIO_PinSetPeripheralMode(GPIOF, kGPIO_Pin7, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOC0 (pin 3)  */
    GPIO_PinSetDirection(GPIOC, kGPIO_Pin0, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOC1 (pin 4)  */
    GPIO_PinSetDirection(GPIOC, kGPIO_Pin1, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOC5 (pin 18)  */
    GPIO_PinSetDirection(GPIOC, kGPIO_Pin5, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOC7 (pin 32)  */
    GPIO_PinSetDirection(GPIOC, kGPIO_Pin7, kGPIO_DigitalInput);

