nxp-appcodehub/an-bidirectional-dcdc-mc56f83783/Bidir_DCDC_MC56F83783/board/pin_mux.c
    /* Pin configuration on GPIOE2 (pin 47) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(GPIOE, kGPIO_Pin2, kGPIO_OutputPushPull);
    /* Strength control configuration: Low drive strength is configured */
    GPIO_PinSetDriveStrength(GPIOE, kGPIO_Pin2, kGPIO_DriveStrengthLow);
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(GPIOE, kGPIO_Pin2, kGPIO_SlewRateSlow);

    /* Pin configuration on GPIOE3 (pin 48) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(GPIOE, kGPIO_Pin3, kGPIO_OutputPushPull);
    /* Strength control configuration: Low drive strength is configured */
    GPIO_PinSetDriveStrength(GPIOE, kGPIO_Pin3, kGPIO_DriveStrengthLow);
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(GPIOE, kGPIO_Pin3, kGPIO_SlewRateSlow);

    /* Pin configuration on GPIOE4 (pin 51) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(GPIOE, kGPIO_Pin4, kGPIO_OutputPushPull);
    /* Strength control configuration: Low drive strength is configured */
    GPIO_PinSetDriveStrength(GPIOE, kGPIO_Pin4, kGPIO_DriveStrengthLow);
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(GPIOE, kGPIO_Pin4, kGPIO_SlewRateSlow);

    /* Pin configuration on GPIOE5 (pin 52) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(GPIOE, kGPIO_Pin5, kGPIO_OutputPushPull);
    /* Strength control configuration: Low drive strength is configured */
    GPIO_PinSetDriveStrength(GPIOE, kGPIO_Pin5, kGPIO_DriveStrengthLow);
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(GPIOE, kGPIO_Pin5, kGPIO_SlewRateSlow);

    /* Pin configuration on GPIOE6 (pin 53) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(GPIOE, kGPIO_Pin6, kGPIO_OutputPushPull);
    /* Strength control configuration: Low drive strength is configured */
    GPIO_PinSetDriveStrength(GPIOE, kGPIO_Pin6, kGPIO_DriveStrengthLow);
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(GPIOE, kGPIO_Pin6, kGPIO_SlewRateSlow);

    /* Pin configuration on GPIOE7 (pin 54) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(GPIOE, kGPIO_Pin7, kGPIO_OutputPushPull);
    /* Strength control configuration: Low drive strength is configured */
    GPIO_PinSetDriveStrength(GPIOE, kGPIO_Pin7, kGPIO_DriveStrengthLow);
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(GPIOE, kGPIO_Pin7, kGPIO_SlewRateSlow);

    /* Pin configuration on GPIOF0 (pin 36) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(GPIOF, kGPIO_Pin0, kGPIO_OutputPushPull);
    /* Strength control configuration: Low drive strength is configured */
    GPIO_PinSetDriveStrength(GPIOF, kGPIO_Pin0, kGPIO_DriveStrengthLow);
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(GPIOF, kGPIO_Pin0, kGPIO_SlewRateSlow);

    /* Pin configuration on GPIOF7 (pin 59) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(GPIOF, kGPIO_Pin7, kGPIO_OutputPushPull);
    /* Strength control configuration: Low drive strength is configured */
    GPIO_PinSetDriveStrength(GPIOF, kGPIO_Pin7, kGPIO_DriveStrengthLow);
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(GPIOF, kGPIO_Pin7, kGPIO_SlewRateSlow);

    /* Interrupt configuration on GPIOC0 (pin 3): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOC, kGPIO_Pin0, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOC1 (pin 4): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOC, kGPIO_Pin1, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOC5 (pin 18): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOC, kGPIO_Pin5, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOC7 (pin 32): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOC, kGPIO_Pin7, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOC8 (pin 33): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOC, kGPIO_Pin8, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOC13 (pin 49): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOC, kGPIO_Pin13, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOC15 (pin 56): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOC, kGPIO_Pin15, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOE0 (pin 45): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOE, kGPIO_Pin0, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOE1 (pin 46): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOE, kGPIO_Pin1, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOE2 (pin 47): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOE, kGPIO_Pin2, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOE3 (pin 48): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOE, kGPIO_Pin3, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOE4 (pin 51): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOE, kGPIO_Pin4, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOE5 (pin 52): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOE, kGPIO_Pin5, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOE6 (pin 53): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOE, kGPIO_Pin6, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOE7 (pin 54): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOE, kGPIO_Pin7, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOF0 (pin 36): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOF, kGPIO_Pin0, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOF7 (pin 59): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOF, kGPIO_Pin7, kGPIO_InterruptDisable);

    GPIOC->PUR =
        ((GPIOC->PUR &
          /* Mask bits to zero which are setting */
          (~(GPIO_PUR_PU_0_MASK | GPIO_PUR_PU_1_MASK | GPIO_PUR_PU_5_MASK | GPIO_PUR_PU_7_MASK | GPIO_PUR_PU_8_MASK | GPIO_PUR_PU_13_MASK | GPIO_PUR_PU_15_MASK)))

