nxp-appcodehub/an-bidirectional-dcdc-mc56f83783/Bidir_DCDC_MC56F83783/board/pin_mux.c
         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_0_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_1_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_5_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_7_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_8_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_13_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_15_DISABLED));

    GPIOC->PUS =
        ((GPIOC->PUS &
          /* Mask bits to zero which are setting */
          (~(GPIO_PUS_PUS_0_MASK | GPIO_PUS_PUS_1_MASK | GPIO_PUS_PUS_5_MASK | GPIO_PUS_PUS_7_MASK | GPIO_PUS_PUS_8_MASK | GPIO_PUS_PUS_13_MASK | GPIO_PUS_PUS_15_MASK)))

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_0_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_1_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_5_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_7_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_8_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_13_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_15_PULLUP));

    GPIOE->PUR =
        ((GPIOE->PUR &
          /* Mask bits to zero which are setting */
          (~(GPIO_PUR_PU_0_MASK | GPIO_PUR_PU_1_MASK | GPIO_PUR_PU_2_MASK | GPIO_PUR_PU_3_MASK | GPIO_PUR_PU_4_MASK | GPIO_PUR_PU_5_MASK | GPIO_PUR_PU_6_MASK | GPIO_PUR_PU_7_MASK)))

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_0_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_1_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_2_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_3_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_4_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_5_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_6_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_7_DISABLED));

    GPIOE->PUS =
        ((GPIOE->PUS &
          /* Mask bits to zero which are setting */
          (~(GPIO_PUS_PUS_0_MASK | GPIO_PUS_PUS_1_MASK | GPIO_PUS_PUS_2_MASK | GPIO_PUS_PUS_3_MASK | GPIO_PUS_PUS_4_MASK | GPIO_PUS_PUS_5_MASK | GPIO_PUS_PUS_6_MASK | GPIO_PUS_PUS_7_MASK)))

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_0_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_1_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_2_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_3_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_4_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_5_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_6_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_7_PULLUP));

    GPIOF->PUR = ((GPIOF->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_0_MASK | GPIO_PUR_PU_7_MASK)))

                  /* Pull Resistor Enable Bits: Pull resistor is disabled. */
                  | GPIO_PUR_PU(PUR_PU_0_DISABLED)

                  /* Pull Resistor Enable Bits: Pull resistor is disabled. */
                  | GPIO_PUR_PU(PUR_PU_7_DISABLED));

    GPIOF->PUS = ((GPIOF->PUS &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUS_PUS_0_MASK | GPIO_PUS_PUS_7_MASK)))

                  /* Pull Resistor Type Select Bits: Pullup resistor. */
                  | GPIO_PUS_PUS(PUS_PUS_0_PULLUP)

                  /* Pull Resistor Type Select Bits: Pullup resistor. */
                  | GPIO_PUS_PUS(PUS_PUS_7_PULLUP));
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT47 output assigned to EVTG0_A */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputEvtg0A);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT48 output assigned to EVTG0_B */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputEvtg0B);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT49 output assigned to EVTG0_C */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputEvtg0C);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT50 output assigned to EVTG0_D */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputEvtg0D);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT51 output assigned to EVTG1_A */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputEvtg1A);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT52 output assigned to EVTG1_B */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputEvtg1B);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT55 output assigned to EVTG2_A */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputEvtg2A);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT56 output assigned to EVTG2_B */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputEvtg2B);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT12 output assigned to ADCA_SYNC */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputAdcaSync);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT16 output assigned to CMPA */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputCmpa);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT18 output assigned to CMPC */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputCmpc);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BDM_Config_Pin:
- options: {createDeInit: 'true', callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '36', peripheral: GPIOF, signal: 'GPIO, 0', pin_signal: GPIOF0/XB_IN6/TB2, direction: OUTPUT}
  - {pin_num: '59', peripheral: GPIOF, signal: 'GPIO, 7', pin_signal: GPIOF7/TB3/CMPC_O/XB_IN3, direction: OUTPUT}
  - {pin_num: '3', peripheral: GPIOC, signal: 'GPIO, 0', pin_signal: GPIOC0/EXTAL/CLKIN0, direction: OUTPUT}
  - {pin_num: '4', peripheral: GPIOC, signal: 'GPIO, 1', pin_signal: GPIOC1/XTAL, direction: OUTPUT}
  - {pin_num: '18', peripheral: GPIOC, signal: 'GPIO, 5', pin_signal: GPIOC5/DACA_O/XB_IN7, direction: OUTPUT}
  - {pin_num: '33', peripheral: GPIOC, signal: 'GPIO, 8', pin_signal: GPIOC8/MISO0/RXD0/XB_IN9, direction: OUTPUT}
  - {pin_num: '49', peripheral: GPIOC, signal: 'GPIO, 13', pin_signal: GPIOC13/TA3/XB_IN6/EWM_OUT_B, direction: OUTPUT}
  - {pin_num: '56', peripheral: GPIOC, signal: 'GPIO, 15', pin_signal: GPIOC15/SCL0/XB_OUT5/PWMA_FAULT5, direction: OUTPUT}
  - {pin_num: '52', peripheral: PWMA, signal: 'A, 2', pin_signal: GPIOE5/PWMA_2A/XB_IN3/XB_OUT9}
  - {pin_num: '51', peripheral: PWMA, signal: 'B, 2', pin_signal: GPIOE4/PWMA_2B/XB_IN2/XB_OUT8}
  - {pin_num: '54', peripheral: PWMA, signal: 'A, 3', pin_signal: GPIOE7/PWMA_3A/XB_IN5/PWMB_2A/XB_OUT11}
  - {pin_num: '53', peripheral: PWMA, signal: 'B, 3', pin_signal: GPIOE6/PWMA_3B/XB_IN4/PWMB_2B/XB_OUT10}
  - {peripheral: EVTG, signal: 'EVTG1, A', pin_signal: PWMA0_MUX_TRIG0}
  - {peripheral: EVTG, signal: 'EVTG1, B', pin_signal: CMPC_OUT}
  - {peripheral: EVTG, signal: 'EVTG2, A', pin_signal: PWMA1_MUX_TRIG0}
  - {peripheral: EVTG, signal: 'EVTG2, B', pin_signal: CMPD_OUT}
  - {pin_num: '46', peripheral: EVTG, signal: 'EVTG1_OUT, A', pin_signal: GPIOE1/PWMA_0A/XB_OUT5}
  - {pin_num: '47', peripheral: EVTG, signal: 'EVTG1_OUT, B', pin_signal: GPIOE2/PWMA_1B/XB_OUT6}
  - {pin_num: '45', peripheral: EVTG, signal: 'EVTG2_OUT, A', pin_signal: GPIOE0/PWMA_0B/XB_OUT4}
  - {pin_num: '48', peripheral: EVTG, signal: 'EVTG2_OUT, B', pin_signal: GPIOE3/PWMA_1A/XB_OUT7}
  - {peripheral: ADC, signal: 'SYNC, A', pin_signal: PWMA2_MUX_TRIG0}
  - {pin_num: '50', peripheral: PWMA, signal: 'FAULT, 0', pin_signal: GPIOF1/CLKO1/XB_IN7/CMPD_O}
  - {peripheral: PWMA, signal: 'EXT_SYNC, 3', pin_signal: PWMA0_MUX_TRIG1}
  - {peripheral: TMRA, signal: 'IN, 0', pin_signal: CMPC_OUT}
  - {peripheral: TMRA, signal: 'IN, 1', pin_signal: CMPD_OUT}
  - {peripheral: EVTG, signal: 'EVTG0, A', pin_signal: TA0_OUT}
  - {peripheral: EVTG, signal: 'EVTG0, B', pin_signal: TA1_OUT}
  - {peripheral: EVTG, signal: 'EVTG0, C', pin_signal: TA2_OUT}
  - {peripheral: EVTG, signal: 'EVTG0, D', pin_signal: TA3_OUT}
  - {peripheral: CMPC, signal: WIN_SMP, pin_signal: EVTG0_OUTB}
  - {peripheral: CMPD, signal: WIN_SMP, pin_signal: EVTG0_OUTA}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

