nxp-appcodehub/an-bidirectional-dcdc-mc56f83783/Bidir_DCDC_MC56F83783/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BDM_Config_Pin
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BDM_Config_Pin(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* GPIOE IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOE);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIO functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMode(BDM_CONFIG_PIN_User_LED_GPIO, BDM_CONFIG_PIN_User_LED_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOC1 (pin 4) */
    GPIO_PinSetPeripheralMode(BDM_CONFIG_PIN_LED_HVP_GPIO, BDM_CONFIG_PIN_LED_HVP_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOC5 (pin 18) */
    GPIO_PinSetPeripheralMode(BDM_CONFIG_PIN_XBAR_TP2_GPIO, BDM_CONFIG_PIN_XBAR_TP2_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOC8 (pin 33) */
    GPIO_PinSetPeripheralMode(BDM_CONFIG_PIN_User_LED1_GPIO, BDM_CONFIG_PIN_User_LED1_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOC13 (pin 49) */
    GPIO_PinSetPeripheralMode(BDM_CONFIG_PIN_XBAR_TP1_GPIO, BDM_CONFIG_PIN_XBAR_TP1_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOC15 (pin 56) */
    GPIO_PinSetPeripheralMode(BDM_CONFIG_PIN_STB_EN_GPIO, BDM_CONFIG_PIN_STB_EN_PIN_MASK, kGPIO_ModeGpio);
    /* Enable peripheral functionality on pin GPIOE0 (pin 45) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE0 (pin 45) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E0_XB_OUT4);
    /* Enable peripheral functionality on pin GPIOE1 (pin 46) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin1, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE1 (pin 46) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E1_XB_OUT5);
    /* Enable peripheral functionality on pin GPIOE2 (pin 47) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin2, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE2 (pin 47) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E2_XB_OUT6);
    /* Enable peripheral functionality on pin GPIOE3 (pin 48) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin3, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE3 (pin 48) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E3_XB_OUT7);
    /* Enable peripheral functionality on pin GPIOE4 (pin 51) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin4, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE4 (pin 51) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E4_PWMA_2B);
    /* Enable peripheral functionality on pin GPIOE5 (pin 52) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin5, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE5 (pin 52) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E5_PWMA_2A);
    /* Enable peripheral functionality on pin GPIOE6 (pin 53) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin6, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE6 (pin 53) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E6_PWMA_3B);
    /* Enable peripheral functionality on pin GPIOE7 (pin 54) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin7, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE7 (pin 54) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E7_PWMA_3A);
    /* GPIO functionality on pin GPIOF0 (pin 36) */
    GPIO_PinSetPeripheralMode(BDM_CONFIG_PIN_XBAR_TP3_GPIO, BDM_CONFIG_PIN_XBAR_TP3_PIN_MASK, kGPIO_ModeGpio);
    /* Enable peripheral functionality on pin GPIOF1 (pin 50) */
    GPIO_PinSetPeripheralMode(GPIOF, kGPIO_Pin1, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF1 (pin 50) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F1_XB_IN7);
    /* GPIO functionality on pin GPIOF7 (pin 59) */
    GPIO_PinSetPeripheralMode(BDM_CONFIG_PIN_Load_SW_GPIO, BDM_CONFIG_PIN_Load_SW_PIN_MASK, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOC0 (pin 3)  */
    GPIO_PinWrite(BDM_CONFIG_PIN_User_LED_GPIO, BDM_CONFIG_PIN_User_LED_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BDM_CONFIG_PIN_User_LED_GPIO, BDM_CONFIG_PIN_User_LED_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOC1 (pin 4)  */
    GPIO_PinWrite(BDM_CONFIG_PIN_LED_HVP_GPIO, BDM_CONFIG_PIN_LED_HVP_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BDM_CONFIG_PIN_LED_HVP_GPIO, BDM_CONFIG_PIN_LED_HVP_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOC5 (pin 18)  */
    GPIO_PinWrite(BDM_CONFIG_PIN_XBAR_TP2_GPIO, BDM_CONFIG_PIN_XBAR_TP2_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BDM_CONFIG_PIN_XBAR_TP2_GPIO, BDM_CONFIG_PIN_XBAR_TP2_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOC8 (pin 33)  */
    GPIO_PinWrite(BDM_CONFIG_PIN_User_LED1_GPIO, BDM_CONFIG_PIN_User_LED1_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BDM_CONFIG_PIN_User_LED1_GPIO, BDM_CONFIG_PIN_User_LED1_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOC13 (pin 49)  */
    GPIO_PinWrite(BDM_CONFIG_PIN_XBAR_TP1_GPIO, BDM_CONFIG_PIN_XBAR_TP1_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BDM_CONFIG_PIN_XBAR_TP1_GPIO, BDM_CONFIG_PIN_XBAR_TP1_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOC15 (pin 56)  */
    GPIO_PinWrite(BDM_CONFIG_PIN_STB_EN_GPIO, BDM_CONFIG_PIN_STB_EN_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BDM_CONFIG_PIN_STB_EN_GPIO, BDM_CONFIG_PIN_STB_EN_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF0 (pin 36)  */
    GPIO_PinWrite(BDM_CONFIG_PIN_XBAR_TP3_GPIO, BDM_CONFIG_PIN_XBAR_TP3_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BDM_CONFIG_PIN_XBAR_TP3_GPIO, BDM_CONFIG_PIN_XBAR_TP3_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF7 (pin 59)  */
    GPIO_PinWrite(BDM_CONFIG_PIN_Load_SW_GPIO, BDM_CONFIG_PIN_Load_SW_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BDM_CONFIG_PIN_Load_SW_GPIO, BDM_CONFIG_PIN_Load_SW_PIN_MASK, kGPIO_DigitalOutput);

