nxp-appcodehub/an-bidirectional-dcdc-mc56f83783/Bidir_DCDC_MC56F83783/board/pin_mux.c
    /* Initialize GPIO functionality on pin GPIOC8 (pin 33)  */
    GPIO_PinSetDirection(BDM_CONFIG_PIN_DEINIT_User_LED1_GPIO, BDM_CONFIG_PIN_DEINIT_User_LED1_PIN_MASK, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOC13 (pin 49)  */
    GPIO_PinSetDirection(BDM_CONFIG_PIN_DEINIT_XBAR_TP1_GPIO, BDM_CONFIG_PIN_DEINIT_XBAR_TP1_PIN_MASK, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOC15 (pin 56)  */
    GPIO_PinSetDirection(BDM_CONFIG_PIN_DEINIT_STB_EN_GPIO, BDM_CONFIG_PIN_DEINIT_STB_EN_PIN_MASK, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOE0 (pin 45)  */
    GPIO_PinSetDirection(GPIOE, kGPIO_Pin0, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOE1 (pin 46)  */
    GPIO_PinSetDirection(GPIOE, kGPIO_Pin1, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOE2 (pin 47)  */
    GPIO_PinSetDirection(GPIOE, kGPIO_Pin2, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOE3 (pin 48)  */
    GPIO_PinSetDirection(GPIOE, kGPIO_Pin3, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOE4 (pin 51)  */
    GPIO_PinSetDirection(GPIOE, kGPIO_Pin4, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOE5 (pin 52)  */
    GPIO_PinSetDirection(GPIOE, kGPIO_Pin5, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOE6 (pin 53)  */
    GPIO_PinSetDirection(GPIOE, kGPIO_Pin6, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOE7 (pin 54)  */
    GPIO_PinSetDirection(GPIOE, kGPIO_Pin7, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOF0 (pin 36)  */
    GPIO_PinSetDirection(BDM_CONFIG_PIN_DEINIT_XBAR_TP3_GPIO, BDM_CONFIG_PIN_DEINIT_XBAR_TP3_PIN_MASK, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOF1 (pin 50)  */
    GPIO_PinSetDirection(GPIOF, kGPIO_Pin1, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOF7 (pin 59)  */
    GPIO_PinSetDirection(BDM_CONFIG_PIN_DEINIT_Load_SW_GPIO, BDM_CONFIG_PIN_DEINIT_Load_SW_PIN_MASK, kGPIO_DigitalInput);

    /* Pin configuration on GPIOC0 (pin 3) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(BDM_CONFIG_PIN_DEINIT_User_LED_GPIO, BDM_CONFIG_PIN_DEINIT_User_LED_PIN_MASK, kGPIO_OutputPushPull);
    /* Strength control configuration: Low drive strength is configured */
    GPIO_PinSetDriveStrength(BDM_CONFIG_PIN_DEINIT_User_LED_GPIO, BDM_CONFIG_PIN_DEINIT_User_LED_PIN_MASK, kGPIO_DriveStrengthLow);
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(BDM_CONFIG_PIN_DEINIT_User_LED_GPIO, BDM_CONFIG_PIN_DEINIT_User_LED_PIN_MASK, kGPIO_SlewRateSlow);

    /* Pin configuration on GPIOC1 (pin 4) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(BDM_CONFIG_PIN_DEINIT_LED_HVP_GPIO, BDM_CONFIG_PIN_DEINIT_LED_HVP_PIN_MASK, kGPIO_OutputPushPull);
    /* Strength control configuration: Low drive strength is configured */
    GPIO_PinSetDriveStrength(BDM_CONFIG_PIN_DEINIT_LED_HVP_GPIO, BDM_CONFIG_PIN_DEINIT_LED_HVP_PIN_MASK, kGPIO_DriveStrengthLow);
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(BDM_CONFIG_PIN_DEINIT_LED_HVP_GPIO, BDM_CONFIG_PIN_DEINIT_LED_HVP_PIN_MASK, kGPIO_SlewRateSlow);

    /* Pin configuration on GPIOC5 (pin 18) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(BDM_CONFIG_PIN_DEINIT_XBAR_TP2_GPIO, BDM_CONFIG_PIN_DEINIT_XBAR_TP2_PIN_MASK, kGPIO_OutputPushPull);
    /* Strength control configuration: Low drive strength is configured */
    GPIO_PinSetDriveStrength(BDM_CONFIG_PIN_DEINIT_XBAR_TP2_GPIO, BDM_CONFIG_PIN_DEINIT_XBAR_TP2_PIN_MASK, kGPIO_DriveStrengthLow);
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(BDM_CONFIG_PIN_DEINIT_XBAR_TP2_GPIO, BDM_CONFIG_PIN_DEINIT_XBAR_TP2_PIN_MASK, kGPIO_SlewRateSlow);

    /* Pin configuration on GPIOC8 (pin 33) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(BDM_CONFIG_PIN_DEINIT_User_LED1_GPIO, BDM_CONFIG_PIN_DEINIT_User_LED1_PIN_MASK, kGPIO_OutputPushPull);
    /* Strength control configuration: Low drive strength is configured */
    GPIO_PinSetDriveStrength(BDM_CONFIG_PIN_DEINIT_User_LED1_GPIO, BDM_CONFIG_PIN_DEINIT_User_LED1_PIN_MASK, kGPIO_DriveStrengthLow);
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(BDM_CONFIG_PIN_DEINIT_User_LED1_GPIO, BDM_CONFIG_PIN_DEINIT_User_LED1_PIN_MASK, kGPIO_SlewRateSlow);

    /* Pin configuration on GPIOC13 (pin 49) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(BDM_CONFIG_PIN_DEINIT_XBAR_TP1_GPIO, BDM_CONFIG_PIN_DEINIT_XBAR_TP1_PIN_MASK, kGPIO_OutputPushPull);
    /* Strength control configuration: Low drive strength is configured */
    GPIO_PinSetDriveStrength(BDM_CONFIG_PIN_DEINIT_XBAR_TP1_GPIO, BDM_CONFIG_PIN_DEINIT_XBAR_TP1_PIN_MASK, kGPIO_DriveStrengthLow);
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(BDM_CONFIG_PIN_DEINIT_XBAR_TP1_GPIO, BDM_CONFIG_PIN_DEINIT_XBAR_TP1_PIN_MASK, kGPIO_SlewRateSlow);

    /* Pin configuration on GPIOC15 (pin 56) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(BDM_CONFIG_PIN_DEINIT_STB_EN_GPIO, BDM_CONFIG_PIN_DEINIT_STB_EN_PIN_MASK, kGPIO_OutputPushPull);
    /* Strength control configuration: Low drive strength is configured */
    GPIO_PinSetDriveStrength(BDM_CONFIG_PIN_DEINIT_STB_EN_GPIO, BDM_CONFIG_PIN_DEINIT_STB_EN_PIN_MASK, kGPIO_DriveStrengthLow);
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(BDM_CONFIG_PIN_DEINIT_STB_EN_GPIO, BDM_CONFIG_PIN_DEINIT_STB_EN_PIN_MASK, kGPIO_SlewRateSlow);

    /* Pin configuration on GPIOE0 (pin 45) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(GPIOE, kGPIO_Pin0, kGPIO_OutputPushPull);
    /* Strength control configuration: Low drive strength is configured */
    GPIO_PinSetDriveStrength(GPIOE, kGPIO_Pin0, kGPIO_DriveStrengthLow);
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(GPIOE, kGPIO_Pin0, kGPIO_SlewRateSlow);

    /* Pin configuration on GPIOE1 (pin 46) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(GPIOE, kGPIO_Pin1, kGPIO_OutputPushPull);
    /* Strength control configuration: Low drive strength is configured */
    GPIO_PinSetDriveStrength(GPIOE, kGPIO_Pin1, kGPIO_DriveStrengthLow);
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(GPIOE, kGPIO_Pin1, kGPIO_SlewRateSlow);

