nxp-appcodehub/an-bidirectional-dcdc-mc56f83783/Bidir_DCDC_MC56F83783/board/pin_mux.c
    /* Interrupt configuration on GPIOE7 (pin 54): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOE, kGPIO_Pin7, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOF0 (pin 36): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(BDM_CONFIG_PIN_DEINIT_XBAR_TP3_GPIO, BDM_CONFIG_PIN_DEINIT_XBAR_TP3_PIN_MASK, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOF1 (pin 50): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(GPIOF, kGPIO_Pin1, kGPIO_InterruptDisable);

    /* Interrupt configuration on GPIOF7 (pin 59): Interrupt is disabled */
    GPIO_PinSetInterruptConfig(BDM_CONFIG_PIN_DEINIT_Load_SW_GPIO, BDM_CONFIG_PIN_DEINIT_Load_SW_PIN_MASK, kGPIO_InterruptDisable);

    GPIOC->PUR =
        ((GPIOC->PUR &
          /* Mask bits to zero which are setting */
          (~(GPIO_PUR_PU_0_MASK | GPIO_PUR_PU_1_MASK | GPIO_PUR_PU_5_MASK | GPIO_PUR_PU_8_MASK | GPIO_PUR_PU_13_MASK | GPIO_PUR_PU_15_MASK)))

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_0_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_1_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_5_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_8_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_13_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_15_DISABLED));

    GPIOC->PUS =
        ((GPIOC->PUS &
          /* Mask bits to zero which are setting */
          (~(GPIO_PUS_PUS_0_MASK | GPIO_PUS_PUS_1_MASK | GPIO_PUS_PUS_5_MASK | GPIO_PUS_PUS_8_MASK | GPIO_PUS_PUS_13_MASK | GPIO_PUS_PUS_15_MASK)))

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_0_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_1_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_5_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_8_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_13_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_15_PULLUP));

    GPIOE->PUR =
        ((GPIOE->PUR &
          /* Mask bits to zero which are setting */
          (~(GPIO_PUR_PU_0_MASK | GPIO_PUR_PU_1_MASK | GPIO_PUR_PU_2_MASK | GPIO_PUR_PU_3_MASK | GPIO_PUR_PU_4_MASK | GPIO_PUR_PU_5_MASK | GPIO_PUR_PU_6_MASK | GPIO_PUR_PU_7_MASK)))

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_0_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_1_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_2_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_3_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_4_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_5_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_6_DISABLED)

         /* Pull Resistor Enable Bits: Pull resistor is disabled. */
         | GPIO_PUR_PU(PUR_PU_7_DISABLED));

    GPIOE->PUS =
        ((GPIOE->PUS &
          /* Mask bits to zero which are setting */
          (~(GPIO_PUS_PUS_0_MASK | GPIO_PUS_PUS_1_MASK | GPIO_PUS_PUS_2_MASK | GPIO_PUS_PUS_3_MASK | GPIO_PUS_PUS_4_MASK | GPIO_PUS_PUS_5_MASK | GPIO_PUS_PUS_6_MASK | GPIO_PUS_PUS_7_MASK)))

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_0_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_1_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_2_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_3_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_4_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_5_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_6_PULLUP)

         /* Pull Resistor Type Select Bits: Pullup resistor. */
         | GPIO_PUS_PUS(PUS_PUS_7_PULLUP));

    GPIOF->PUR = ((GPIOF->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_0_MASK | GPIO_PUR_PU_1_MASK | GPIO_PUR_PU_7_MASK)))

                  /* Pull Resistor Enable Bits: Pull resistor is disabled. */
                  | GPIO_PUR_PU(PUR_PU_0_DISABLED)

                  /* Pull Resistor Enable Bits: Pull resistor is disabled. */
                  | GPIO_PUR_PU(PUR_PU_1_DISABLED)

                  /* Pull Resistor Enable Bits: Pull resistor is disabled. */
                  | GPIO_PUR_PU(PUR_PU_7_DISABLED));

    GPIOF->PUS = ((GPIOF->PUS &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUS_PUS_0_MASK | GPIO_PUS_PUS_1_MASK | GPIO_PUS_PUS_7_MASK)))

                  /* Pull Resistor Type Select Bits: Pullup resistor. */
                  | GPIO_PUS_PUS(PUS_PUS_0_PULLUP)

                  /* Pull Resistor Type Select Bits: Pullup resistor. */
                  | GPIO_PUS_PUS(PUS_PUS_1_PULLUP)

                  /* Pull Resistor Type Select Bits: Pullup resistor. */
                  | GPIO_PUS_PUS(PUS_PUS_7_PULLUP));
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT27 output assigned to PWMA3_EXT_SYNC */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputPwma3ExtSync);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT47 output assigned to EVTG0_A */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputEvtg0A);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT48 output assigned to EVTG0_B */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputEvtg0B);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT49 output assigned to EVTG0_C */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputEvtg0C);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT50 output assigned to EVTG0_D */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputEvtg0D);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT51 output assigned to EVTG1_A */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputEvtg1A);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT52 output assigned to EVTG1_B */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputEvtg1B);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT55 output assigned to EVTG2_A */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputEvtg2A);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT56 output assigned to EVTG2_B */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputEvtg2B);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT12 output assigned to ADCA_SYNC */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputAdcaSync);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT18 output assigned to CMPC */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputCmpc);
    /* VSS output assigned to XBARA_IN0 input is connected
     * to XBARA_OUT19 output assigned to CMPD */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputVss, kXBARA_OutputCmpd);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
Common_Config_Pin:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '58', peripheral: TMRB, signal: 'IN, 0', pin_signal: GPIOF6/TB2/PWMA_3X/PWMB_3X/XB_IN2}
  - {pin_num: '8', peripheral: TMRB, signal: 'IN, 1', pin_signal: GPIOC4/TA1/CMPB_O/XB_IN8/EWM_OUT_B}
  - {pin_num: '15', peripheral: ADC, signal: 'ANA, 2', pin_signal: GPIOA2/ANA2/VREFHA/CMPA_IN1}
  - {pin_num: '16', peripheral: ADC, signal: 'ANA, 3', pin_signal: GPIOA3/ANA3/VREFLA/CMPA_IN2}
  - {pin_num: '9', peripheral: ADC, signal: 'ANA, 7', pin_signal: GPIOA7/ANA7}
  - {pin_num: '24', peripheral: ADC, signal: 'ANB, 0', pin_signal: GPIOB0/ANB0/CMPB_IN3}
  - {pin_num: '25', peripheral: ADC, signal: 'ANB, 1', pin_signal: GPIOB1/ANB1/CMPB_IN0/DACB_O}
  - {pin_num: '19', peripheral: ADC, signal: 'ANB, 6', pin_signal: GPIOB6/ANB6/CMPB_IN1}
  - {pin_num: '17', peripheral: ADC, signal: 'ANB, 7', pin_signal: GPIOB7/ANB7/CMPB_IN2}
  - {pin_num: '14', peripheral: CMPA, signal: 'IN, 0', pin_signal: GPIOA1/ANA1/CMPA_IN0}
  - {pin_num: '13', peripheral: CMPA, signal: 'IN, 3', pin_signal: GPIOA0/ANA0/CMPA_IN3/CMPC_O}
  - {pin_num: '25', peripheral: CMPB, signal: 'IN, 0', pin_signal: GPIOB1/ANB1/CMPB_IN0/DACB_O}
  - {pin_num: '17', peripheral: CMPB, signal: 'IN, 2', pin_signal: GPIOB7/ANB7/CMPB_IN2}
  - {pin_num: '24', peripheral: CMPB, signal: 'IN, 3', pin_signal: GPIOB0/ANB0/CMPB_IN3}
  - {pin_num: '21', peripheral: CMPC, signal: 'IN, 1', pin_signal: GPIOB4/ANB4/CMPC_IN1}
  - {pin_num: '20', peripheral: CMPC, signal: 'IN, 2', pin_signal: GPIOB5/ANB5/CMPC_IN2}
  - {pin_num: '27', peripheral: CMPC, signal: 'IN, 3', pin_signal: GPIOB2/ANB2/VREFHB/CMPC_IN3}
  - {pin_num: '12', peripheral: CMPD, signal: 'IN, 0', pin_signal: GPIOA4/ANA4/CMPD_IN0}
  - {pin_num: '4', peripheral: GPIOC, signal: 'GPIO, 1', pin_signal: GPIOC1/XTAL, direction: OUTPUT}
  - {pin_num: '38', peripheral: QSCI1, signal: RXD, pin_signal: GPIOC12/CANRX/SDA1/RXD1}
  - {pin_num: '37', peripheral: QSCI1, signal: TXD, pin_signal: GPIOC11/CANTX/SCL1/TXD1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

