nxp-appcodehub/an-bidirectional-dcdc-mc56f83783/Bidir_DCDC_MC56F83783/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : Common_Config_Pin
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void Common_Config_Pin(void)
{
    /* GPIOA IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOA);
    /* GPIOB IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOB);
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* Enable peripheral functionality on pin GPIOA0 (pin 13) */
    GPIO_PinSetPeripheralMode(GPIOA, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOA0 (pin 13) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_A0_ANA0_and_CMPA_IN3);
    /* Enable peripheral functionality on pin GPIOA1 (pin 14) */
    GPIO_PinSetPeripheralMode(GPIOA, kGPIO_Pin1, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA2 (pin 15) */
    GPIO_PinSetPeripheralMode(GPIOA, kGPIO_Pin2, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA3 (pin 16) */
    GPIO_PinSetPeripheralMode(GPIOA, kGPIO_Pin3, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA4 (pin 12) */
    GPIO_PinSetPeripheralMode(GPIOA, kGPIO_Pin4, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA7 (pin 9) */
    GPIO_PinSetPeripheralMode(GPIOA, kGPIO_Pin7, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB0 (pin 24) */
    GPIO_PinSetPeripheralMode(GPIOB, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB1 (pin 25) */
    GPIO_PinSetPeripheralMode(GPIOB, kGPIO_Pin1, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOB1 (pin 25) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_B1_ANB1_and_CMPB_IN0);
    /* Enable peripheral functionality on pin GPIOB2 (pin 27) */
    GPIO_PinSetPeripheralMode(GPIOB, kGPIO_Pin2, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB4 (pin 21) */
    GPIO_PinSetPeripheralMode(GPIOB, kGPIO_Pin4, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB5 (pin 20) */
    GPIO_PinSetPeripheralMode(GPIOB, kGPIO_Pin5, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB6 (pin 19) */
    GPIO_PinSetPeripheralMode(GPIOB, kGPIO_Pin6, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB7 (pin 17) */
    GPIO_PinSetPeripheralMode(GPIOB, kGPIO_Pin7, kGPIO_ModePeripheral);
    /* GPIO functionality on pin GPIOC1 (pin 4) */
    GPIO_PinSetPeripheralMode(COMMON_CONFIG_PIN_LED_HVP_GPIO, COMMON_CONFIG_PIN_LED_HVP_PIN_MASK, kGPIO_ModeGpio);
    /* Enable peripheral functionality on pin GPIOC4 (pin 8) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin4, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC4 (pin 8) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C4_XB_IN8);
    /* Enable peripheral functionality on pin GPIOC11 (pin 37) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin11, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC11 (pin 37) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C11_TXD1);
    /* Enable peripheral functionality on pin GPIOC12 (pin 38) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin12, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC12 (pin 38) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C12_RXD1);
    /* Enable peripheral functionality on pin GPIOF6 (pin 58) */
    GPIO_PinSetPeripheralMode(GPIOF, kGPIO_Pin6, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF6 (pin 58) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F6_XB_IN2);

    /* Initialize GPIO functionality on pin GPIOC1 (pin 4)  */
    GPIO_PinWrite(COMMON_CONFIG_PIN_LED_HVP_GPIO, COMMON_CONFIG_PIN_LED_HVP_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(COMMON_CONFIG_PIN_LED_HVP_GPIO, COMMON_CONFIG_PIN_LED_HVP_PIN_MASK, kGPIO_DigitalOutput);

    /* Internal Peripheral Select */
    /* Select TMRB0 Input.: Select TMRB0 Input, XB_OUT34. */
    SIM_SetInternalPeriInput(SIM, kSIM_TMRB0InputIndex, kSIM_TMRB0Input_XB_OUT34);
    /* Select TMRB1 Input.: Select TMRB1 Input, XB_OUT35. */
    SIM_SetInternalPeriInput(SIM, kSIM_TMRB1InputIndex, kSIM_TMRB1Input_XB_OUT35);

    /* XB_IN2 output assigned to XBARA_IN2 input is connected
     * to XBARA_OUT34 output assigned to TB0_IN */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputXbIn2, kXBARA_OutputTb0In);
    /* XB_IN8 output assigned to XBARA_IN8 input is connected
     * to XBARA_OUT35 output assigned to TB1_IN */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputXbIn8, kXBARA_OutputTb1In);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
